package application;

import java.util.Random;

public class Quiz {

//-------------------------メンバ変数---------------------------
/*******************カレー******************/
	private String[] curry_name = {"ルー", "じゃがいも", "にんじん", "玉ねぎ", "肉"};//食材の名前
	private String[][] quiz_curry = {{"ルーはフランス語でどういう意味？", "市販のカレールーとして実際に存在するものは？", "次のうちカレールーに入っていないものは？"},//ルー
										{"普段私たちが食べているのはじゃがいものどの部分？", "じゃがいもの品種で実在するものはどれ？", "じゃがいも料理は次のうちどれ？"},//じゃがいも
										{"にんじんの品種で実在するものはどれ？", "にんじん料理は次のうちどれ？", "にんじんは何科？"},//にんじん
										{"涙を流さずに玉ねぎを切る方法は？", "3～4月に出荷される玉ねぎは何と呼ばれているか？", "玉ねぎを生で食べるとき辛みを抑える方法は？"},//たまねぎ
										{"バラ肉はどの部位？", "もも肉はどの部位？", "霜降り肉とは？"}//肉
									};//カレーの食材に関する知識

	private String[][][] quiz_curry_choice =
		{
				{   {"スープにとろみをつけるもの", "茶色", "りんご"},//ルー
					{"ハーモンドカレー", "バーモンドカレー", "パーモンドカレー"},
					{"ガラムマサラ", "クミン", "一味唐辛子"}, },
				{	{"くき", "根っこ", "全部"},//じゃがいも
					{"コシヒカリ", "ジャンボスイート", "北あかり"},
					{"ジャーマンポテト", "フリカデレ", "ステーキ"}, },
				{	{"オニオンキャロット", "ウインナーキャロット", "キャロットキャロット"},//にんじん
					{"にんじんぷりぷり", "にんじんすりすり", "にんじんしりしり"},
					{"セリ科", "ニンジン科", "情報科"}, },
				{	{"常温で放置してから切る", "玉ねぎを冷やしてから切る", "たまねぎに自分の名前を書いてから切る"},//たまねぎ
					{"鬼玉ねぎ", "赤玉ねぎ", "新玉ねぎ"},
					{"冷凍する", "切った後、水にさらす", "１周半転がす"}, },
				{	{"バラバラの肉", "あばら骨の周囲の肉", "背骨の周囲の肉"},//肉
					{"前足の付け根", "右耳の付け根", "後ろ足の付け根"},
					{"１kgあたり5万円の肉", "金箔がふりかかっている肉", "脂肪が網の目の様に入っている肉"}, },
		};//カレーの食材に関する知識の選択肢


	private int[][] quiz_curry_answer = {{1, 2, 3},
											{1, 3, 1},
											{2, 3, 1},
											{2, 3, 2},
											{2, 3, 3},
										};//カレーの食材に関する知識の答え


/*********************麻婆豆腐************************/
	private String[] mabo_name = {"豆腐", "ひき肉", "ネギ", "豆板醤", "甜麺醤"};//食材の名前
	private String[][] quiz_salad = {{"豆腐の発祥国は？", "豆腐が日本に伝わったのは何時代？", "豆腐は腐るとどうなる？"},//豆腐
									{"牛ひき肉と豚ひき肉を合わせたものを何という？", "英語でひき肉を何というか？", "ひき肉を使った料理として正しいものは？"},//ひき肉
									{"ネギの効果として正しいものはどれ？", "ネギの効果として正しいものはどれ？", "甘くておいしいネギの選び方は？"},//ネギ
									{"豆板醤の発祥国は？", "豆板醤の豆は何豆？", "「豆板醤」の読み方は？"},//豆板醤
									{"「甜麺醤」の読み方は？", "甜麺醤(テンメンジャン)の発祥国は？", "甜麺醤(テンメンジャン)の主な原料は？"}//甜麺醤
								};//麻婆豆腐の食材に関する知識

	private String[][][] quiz_mabo_choice =
						{
						{   {"イタリア", "日本", "中国"},//豆腐
						{"奈良時代", "令和時代", "江戸時代"},
						{"苦くなる", "辛くなる", "酸っぱくなる"}, },
						{	{"合いびき肉", "鶏ひき肉", "牛豚ひき肉"},//ひき肉
						{"ground meat", "minced meat", "hikiniku"},
						{"しゃぶしゃぶ", "チンジャオロース", "ハンバーグ"}, },
						{	{"活舌が良くなる", "疲労回復", "耳が良くなる"},//ネギ
						{"足が速くなる", "風邪予防", "盲腸になりやすくなる"},
						{"しなしなになっている", "出来るだけ長い", "葉の先までピンと張りがある"}, },
						{	{"中国", "韓国", "セネガル"},//豆板醤
						{"枝豆", "そら豆", "ピスタチオ"},
						{"トウバンジャン", "コチュジャン", "マメイタジャン"}, },
						{	{"テンメンジャン", "デンメンジャン", "ユッケジャン"},//甜麺醤
						{"韓国", "中国", "チリ"},
						{"片栗粉", "粉砂糖", "小麦粉"}, },
						};//麻婆豆腐の食材に関する知識の選択肢

	private int[][] quiz_mabo_answer = {{3, 1, 3},
											{1, 1, 3},
											{2, 2, 3},
											{1, 2, 1},
											{1, 2, 3},
										};//麻婆豆腐の食材に関する知識の答え


/*************************プリン***************************/
	private String[] pudding_name = {"卵", "牛乳", "砂糖", "バニラエッセンス", "カラメルソース"};//食材の名前
	private String[][] quiz_pudding = {{"鶏は一年間でどのくらい卵を産むでしょう？", "卵の賞味期限の意味は？", "黄味についてるヒモみたいなものの名前は？"},//卵
									{"牛の睡眠時間は？", "牛乳には４つの種類がある。誤ったものは？", "牛乳には４つの種類がある。正しいものは？"},//牛乳
									{"「砂糖」は英語で書くと？", "砂糖の役割として正しいものはどれ？", "砂糖の役割として正しいものはどれ？"},//砂糖
									{"バニラエッセンスの役割は？", "バニラは英語でどう書く？", "バニラの花言葉は？"},//バニラエッセンス
									{"カラメルは英語でどう書く？", "カラメルが使われる例として正しいものは？", "カラメルが使われる例として正しいものは？"}//カラメルソース
								};//プリンの食材に関する知識

	private String[][][] quiz_pudding_choice =
								{
								{   {"約100個", "約300個", "約1個"},//卵
								{"卵焼きに最適な期間", "殻が食べれる期間", "生で食べれる期間"},
								{"カラザ", "ハラザ", "カニザ"}, },
								{	{"約3分", "約3時間", "約30時間"},//牛乳
								{"加工乳", "牛乳", "乳飲料"},
								{"牛乳", "脱脂乳", "ニューバランス"}, },
								{	{"sugar", "satoh", "suger"},//砂糖
								{"しょっぱくする", "脂肪を酸化させる", "生クリームなどの泡立ちを保つ"},
								{"辛くする", "肉を柔らかくする", "芋の荷崩れを防ぐ"}, },
								{	{"バニラの香りがつく", "バニラの味が付く", "顔に塗ると美肌になる"},//バニラエッセンス
								{"vanila", "vanilla", "vanillllla"},
								{"一合一会", "鬼滅の刃", "永久不滅"}, },
								{	{"caramel", "karamel", "caramer"},//カラメルソース
								{"カルピスの着色料", "三ツ矢サイダーの着色料", "コーラの着色料"},
								{"しょうゆの色付け", "しょうゆの味付け", "しょうゆの香り付け"}, },
								};//プリンの食材に関する知識の選択肢

	private int[][] quiz_pudding_answer = {{2, 3, 1},
											{2, 2, 2},
											{1, 3, 2},
											{1, 2, 3},
											{1, 3, 1},
										};//プリンの食材に関する知識の答え


/***********決定版***********/
	private String[] quiz_name;//食材の名前(決定版)
	private String[] quiz = new String[5];//今回出す問題(決定版)
	private String[][] quiz_choice = new String[5][3];//今回出す問題(決定版)の選択肢
	private int[] quiz_answer = new int[5];//今回出す問題(決定版)の答え


/***********************************************
 *
 * コンストラクタ
 *
 * *********************************************/

	public Quiz(int menu_select) {

//---------------------クイズの作成-----------------------
		int i,ran;
		Random rand = new Random();
		for(i=0; i<5; i++) {
				ran = rand.nextInt(3);//乱数生成
				//ランダムに決まった問題を格納していく
				switch(menu_select) {
					case 1:
						quiz_name = curry_name;//カレーの食材の名前が入った配列を決定版に代入
						quiz[i] = quiz_curry[i][ran];//問題を決定版に格納
						quiz_choice[i][0] = quiz_curry_choice[i][ran][0];//選択肢を決定版に格納
						quiz_choice[i][1] = quiz_curry_choice[i][ran][1];//選択肢を決定版に格納
						quiz_choice[i][2] = quiz_curry_choice[i][ran][2];//選択肢を決定版に格納
						quiz_answer[i] = quiz_curry_answer[i][ran];//答えを決定版に格納
						break;

					case 2:
						quiz_name = mabo_name;//麻婆豆腐の食材の名前が入った配列を決定版に代入
						quiz[i] = quiz_salad[i][ran];//問題を決定版に格納
						quiz_choice[i][0] = quiz_mabo_choice[i][ran][0];//選択肢を決定版に格納
						quiz_choice[i][1] = quiz_mabo_choice[i][ran][1];//選択肢を決定版に格納
						quiz_choice[i][2] = quiz_mabo_choice[i][ran][2];//選択肢を決定版に格納
						quiz_answer[i] = quiz_mabo_answer[i][ran];//答えを決定版に格納
						break;

					case 3:
						quiz_name = pudding_name;//プリンの食材の名前が入った配列を決定版に代入
						quiz[i] = quiz_pudding[i][ran];//問題を決定版に格納
						quiz_choice[i][0] = quiz_pudding_choice[i][ran][0];//選択肢を決定版に格納
						quiz_choice[i][1] = quiz_pudding_choice[i][ran][1];//選択肢を決定版に格納
						quiz_choice[i][2] = quiz_pudding_choice[i][ran][2];//選択肢を決定版に格納
						quiz_answer[i] = quiz_pudding_answer[i][ran];//答えを決定版に格納
						break;

				}
		}

	}


/***********************************************
 *
 * 間違った問題をもう一度乱数で設定するメソッド
 *
 * *********************************************/

		public void Quiz_reConf(int menu_select, int[] num_event_incorrect) {

//---------------------クイズの作成-----------------------
			int i,ran;
			Random rand = new Random();
			for(i=0; i<5; i++) {
				if(num_event_incorrect[i] == 1) {
					ran = rand.nextInt(3);//乱数生成
					//ランダムに決まった問題を格納していく
					switch(menu_select) {
						case 1:
							quiz_name = curry_name;//カレーの食材の名前が入った配列を決定版に代入
							quiz[i] = quiz_curry[i][ran];//問題を決定版に格納
							quiz_choice[i][0] = quiz_curry_choice[i][ran][0];//選択肢を決定版に格納
							quiz_choice[i][1] = quiz_curry_choice[i][ran][1];//選択肢を決定版に格納
							quiz_choice[i][2] = quiz_curry_choice[i][ran][2];//選択肢を決定版に格納
							quiz_answer[i] = quiz_curry_answer[i][ran];//答えを決定版に格納
							break;

						case 2:
							quiz_name = mabo_name;//麻婆豆腐の食材の名前が入った配列を決定版に代入
							quiz[i] = quiz_salad[i][ran];//問題を決定版に格納
							quiz_choice[i][0] = quiz_mabo_choice[i][ran][0];//選択肢を決定版に格納
							quiz_choice[i][1] = quiz_mabo_choice[i][ran][1];//選択肢を決定版に格納
							quiz_choice[i][2] = quiz_mabo_choice[i][ran][2];//選択肢を決定版に格納
							quiz_answer[i] = quiz_mabo_answer[i][ran];//答えを決定版に格納
							break;

						case 3:
							quiz_name = pudding_name;//プリンの食材の名前が入った配列を決定版に代入
							quiz[i] = quiz_pudding[i][ran];//問題を決定版に格納
							quiz_choice[i][0] = quiz_pudding_choice[i][ran][0];//選択肢を決定版に格納
							quiz_choice[i][1] = quiz_pudding_choice[i][ran][1];//選択肢を決定版に格納
							quiz_choice[i][2] = quiz_pudding_choice[i][ran][2];//選択肢を決定版に格納
							quiz_answer[i] = quiz_pudding_answer[i][ran];//答えを決定版に格納
							break;

					}
				}
			}
		}


/***********************************************
 *
 * quiz_name[]のゲッター
 *
 * *********************************************/
	public String getQuiz_name_i(int i) {//イベント番号i+1番目の食材の名前

		return quiz_name[i];

	}


/***********************************************
 *
 * quiz[]のゲッター
 *
 * *********************************************/
	public String getQuiz_i(int i) {

		return quiz[i];

	}


/***********************************************
 *
 * quiz_choice[]のゲッター
 *
 * *********************************************/
	public String getQuiz_choice_ij(int i, int j) {//問題iの選択肢j

		return quiz_choice[i][j];

	}


/***********************************************
 *
 * quiz_answer[]のゲッター
 *
 * *********************************************/
	public int getQuiz_answer_i(int i) {////問題iの答え

		return quiz_answer[i];

	}
}